import os
my_dict = {"Кольцо": ("Серебро", 1500, 5), "Колье": ("Золото", 4399, 10), "Цепь": ("Серебро", 1488, 13), "Подвеска": ("Золото", 7899, 3), }
a = my_dict.items()
while 1:
    print("1. Просмотр описания: название – описание\n"
          "2. Просмотр цены: название – цена\n"
          "3. Просмотр количества: название – количество\n"
          "4. Всю информацию\n"
          "5. Покупка\n"
          "6. Выход\n")
    i = input()
    if i == '1':
        for i in a:
            print(f"{i[0]} - {i[1][0]}")
    elif i == '2':
        for i in a:
            print(f"{i[0]} - {i[1][1]}р")
    elif i == '3':
        for i in a:
            print(f"{i[0]} - {i[1][2]} шт")
    elif i == '4':
        for i in a:
            print(f"{i[0]} - {i[1][0]} - {i[1][1]}р - {i[1][2]} шт")
    elif i == '5':
        print(1)
    elif i == '6':
        os.system('cls')
        print("До свидания")
        break
    else:
        print("Неверно выбран пункт меню")